pban-rd-dev/gene_firmware_for_solist_ai_dev_kit/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher config
# ESP32-S3-WROOM-1-N16R8 carries 16 MB flash; the old 4 MB setting left
# most of it unusable. 16 MB is required for the "storage" FAT partition
# that backs MIC internal-flash recording.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition Table — custom layout adds a 12 MB FAT "storage" partition
# for MIC internal recording (mic.storage=internal). See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Component config

## FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

## ESP System Settings
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

## UART / Console
CONFIG_ESP_CONSOLE_UART_NONE=y
# Disable default console to allow full control of UART0
# We will manually install uart_driver in uart_handler_init()
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# Disable the USB-Serial-JTAG secondary console too. Otherwise ESP-IDF
# spawns a dedicated console task on PRO_CPU that competes with uart_rx
# for core 0 time. All ESP_LOG output already goes through our UART
# vprintf redirect; we don't need a second log path.

## SPI
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

## I2C
CONFIG_I2C_ENABLE_DEBUG_LOG=n

## Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

## GPIO
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y

## FATFS — enable long filenames so mic_rec_<ms>_<cnt>.wav (>8 chars)
## can be created on the SD card. Without this, fopen returns EINVAL
## because 8.3 SFN is the only format the FS will accept.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64

## PSRAM — DELIBERATELY NOT ENABLED. The module is an ESP32-S3-WROOM-1-N16R8
## whose 8 MB PSRAM is *Octal*, and octal flash/PSRAM consume GPIO33-37 on
## this silicon (GPIO35=SPIIO6, GPIO36=SPIIO7, GPIO37=SPIDQS). The gene v2 PCB
## wires the Solist-AI SPI master to exactly those pins (CLK=36, MOSI/MISO=
## 35/37; see main/spi_hal_esp32s3.c). So enabling PSRAM steals the slave-SPI
## pins: the slave stops responding (app_master_ai_* -> DEVICE_ERROR) and the
## contended lines trigger INT_WDT reboot loops. PSRAM and the Solist-AI SPI
## slave are mutually exclusive on this board. It is also unnecessary: the
## 64 KB command line lives in .bss (g_cmd_line, shared UART/BLE), so full ML
## command parity over BLE needs no PSRAM. Do NOT re-enable without a PCB
## respin that moves the SPI master off GPIO33-37.

## Bluetooth / NimBLE — BLE control transport (docs/ble_control_spec.md).
## The controller + NimBLE host are always linked; they only start when
## config ble.enabled=1 (opt-in, applied at boot). BLE is peripheral-only.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# Larger ATT MTU for higher stream throughput (negotiated per connection).
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
